unit oge08;

interface

function GenerateTasksOge08(count: integer): List<(string, List<(string, string)>, string, string)>;

implementation

function GenSetsValues(): Dictionary<string, integer>;
begin
  var a, b, c, ab, ac, bc, abc: integer;
  repeat
    a := Random(10, 200);  
    b := Random(10, 200);  
    c := Random(10, 200);  
    ab := Random(5, 100);  
    ac := Random(5, 100);  
    bc := Random(5, 100);  
    abc := Random(3, 60);  
    ab := min(a, b, ab);
    ac := min(a, c, ac);
    bc := min(b, c, bc);
    abc := min(abc, ab, ac, bc);
  until (ab <> a) and (ab <> b) and (ac <> a) and (ac <> c) and 
  (bc <> b) and (bc <> c) and (abc <> ab) and (abc <> ac) and (abc <> bc);  
  result := Dict(string('A') to a, string('B') to b, string('C') to c, 
  'AB' to ab, 'AC' to ac, 'BC' to bc, 'ABC' to abc);
end;

function GenTemplates(): List<string>;
begin
  var templates := [
  ['A & B', 'A & C', 'A & B & C', 'A & (B | C)', '(A & B) | (A & C)'],
  ['B & A', 'B & C', 'A & B & C', 'B & (A | C)', '(B & A) | (B & C)'],
  ['C & A', 'C & B', 'A & B & C', 'C & (A | B)', '(C & A) | (C & B)']];
  var ti := Random(templates.Length);
  var t := templates[ti];
  var tt := new List<string>();
  if Random(100) < 50 then 
    tt.Add(t[0][5] + ' & ' + t[0][1])
  else
    tt.Add(t[0]);
  if Random(100) > 50 then
    tt.Add(t[1][5] + ' & ' + t[1][1])  
  else
    tt.Add(t[1]);
  tt.Add(['A', 'B', 'C'].Shuffle.JoinToString(' & '));
  if Random(100) < 50 then
  begin
    var t3 := t[3];
    if Random(100) < 50 then
      t3 := t3[1:6 ] + t3[10] + ' | ' + t3[6] + ')';
    tt.Add(t3);
  end
  else
  begin
    var t3 := t[4];
    if Random(100) < 50 then
      t3 := t3[1:2 ] + t3[6] + ' & ' + t3[2] + t3[7:];
    if Random(100) > 50 then
      t3 := t3[1:12 ] + t3[16] + ' & ' + t3[12] + t3[17:];
    tt.Add(t3);
  end;
  result := tt;
end;

function CalcSets(ts: List<string>; setVals: Dictionary<string, integer>;
sets: Dictionary<char, string>): Dictionary<string, integer>;
begin
  var res := new Dictionary<string, integer>();
  
  var val0 := 0;  
  case ts[0] of
    'A & B', 'B & A': val0 := setVals['AB'];
    'A & C', 'C & A': val0 := setVals['AC'];
    'B & C', 'C & B': val0 := setVals['BC'];
  end;
  ts[0] := ts[0].Replace('A', sets['A'])
    .Replace('B', sets['B']).Replace('C', sets['C']);
  res[ts[0]] := val0;
  
  var val1 := 0;  
  case ts[1] of
    'A & B', 'B & A': val1 := setVals['AB'];
    'A & C', 'C & A': val1 := setVals['AC'];
    'B & C', 'C & B': val1 := setVals['BC'];
  end;
  ts[1] := ts[1].Replace('A', sets['A'])
    .Replace('B', sets['B']).Replace('C', sets['C']);
  res[ts[1]] := val1;
  
  var val2 := setVals['ABC'];
  ts[2] := ts[2].Replace('A', sets['A'])
    .Replace('B', sets['B']).Replace('C', sets['C']);
  res[ts[2]] := val2;
  
  var val3 := 0;
  case ts[3] of
    'A & (B | C)', 'A & (C | B)', 
    '(A & B) | (A & C)', '(A & B) | (C & A)',
    '(B & A) | (A & C)', '(B & A) | (C & A)':
      val3 := setVals['AB'] + setVals['AC'] - setVals['ABC'];
    'B & (A | C)', 'B & (C | A)', 
    '(B & A) | (B & C)', '(B & A) | (C & B)',
    '(A & B) | (B & C)', '(A & B) | (C & B)':
      val3 := setVals['AB'] + setVals['BC'] - setVals['ABC'];
    'C & (A | B)', 'C & (B | A)', 
    '(C & A) | (C & B)', '(C & A) | (B & C)',
    '(A & C) | (C & B)', '(A & C) | (B & C)':
      val3 := setVals['AC'] + setVals['BC'] - setVals['ABC'];
  end;
  ts[3] := ts[3].Replace('A', sets['A'])
    .Replace('B', sets['B']).Replace('C', sets['C']);
  res[ts[3]] := val3;  
  
  result := res;
end;

function GenerateTasksOge08(count: integer): List<(string, List<(string, string)>, string, string)>;
begin
  var res := new List<(string, List<(string, string)>, string, string)>();
  
  var wrds := [['солнце', 'радость', 'тепло'], ['улыбка', 'счастье', 'доброта'], 
  ['друг', 'поддержка', 'успех'], ['мечта', 'вдохновение', 'достижение'], 
  ['смех', 'веселье', 'энергия'], ['любовь', 'гармония', 'нежность'], 
  ['природа', 'свежесть', 'река'], ['творчество', 'идея', 'воплощение'], 
  ['семья', 'уют', 'забота'], ['путешествие', 'открытие', 'свобода'], 
  ['здоровье', 'сила', 'бодрость'], ['добро', 'щедрость', 'благодарность'], 
  ['музыка', 'ритм', 'настроение'], ['книга', 'мудрость', 'воображение'], 
  ['достижение', 'гордость', 'рост'], ['детство', 'игра', 'беззаботность'], 
  ['вода', 'чистота', 'освежение'], ['цветок', 'красота', 'аромат'], 
  ['праздник', 'радость', 'сюрприз'], ['спорт', 'движение', 'выносливость'], 
  ['утро', 'пробуждение', 'свежесть'], ['звезды', 'мечтательность', 'тайна'], 
  ['объятие', 'тепло', 'улыбка'], ['ветер', 'легкость', 'перемены'], 
  ['океан', 'глубина', 'спокойствие'], ['гора', 'высота', 'достижение'], 
  ['дождь', 'обновление', 'чистота'], ['кофе', 'бодрость', 'наслаждение'], 
  ['сад', 'цветение', 'плоды'], ['искренность', 'доверие', 'открытость'], 
  ['благополучие', 'изобилие', 'процветание'], ['танцы', 'ритм', 'музыка'], 
  ['рассвет', 'фото', 'начало'], ['закат', 'умиротворение', 'сон'], 
  ['утро', 'позитив', 'заряд'], ['добро', 'сострадание', 'помощь'], 
  ['день', 'яркость', 'энергия'], ['лето', 'отдых', 'приключения'], 
  ['зима', 'сказка', 'уют'], ['весна', 'пробуждение', 'радость'], 
  ['осень', 'уют', 'вдохновение'], ['море', 'простор', 'безмятежность'], 
  ['лес', 'тишина', 'гармония'], ['птицы', 'крылья', 'свобода'], 
  ['бабочка', 'легкость', 'преображение'], ['магия', 'волшебство', 'разнообразие'], 
  ['фейерверк', 'восторг', 'праздник'], ['шоколад', 'наслаждение', 'удовольствие'], 
  ['фрукты', 'витамины', 'свежесть'], ['аромат', 'уют', 'комфорт'], 
  ['слова', 'поддержка', 'тепло'], ['комплимент', 'радость', 'уверенность'], 
  ['помощь', 'благодарность', 'взаимность'], ['сюрприз', 'восторг', 'радость'], 
  ['победа', 'триумф', 'удовлетворение'], ['учеба', 'знания', 'развитие'], 
  ['работа', 'самореализация', 'успех'], ['хобби', 'увлечение', 'вдохновение'], 
  ['рукоделие', 'творчество', 'уют'], ['рисование', 'краски', 'фантазия'], 
  ['фотография', 'момент', 'память'], ['письмо', 'мысли', 'искренность'], 
  ['чтение', 'погружение', 'развитие'], ['медитация', 'спокойствие', 'баланс'], 
  ['йога', 'гибкость', 'сила'], ['бег', 'скорость', 'дыхание'], 
  ['плавание', 'легкость', 'сила'], ['велосипед', 'движение', 'скорость'], 
  ['лыжи', 'скорость', 'адреналин'], ['сноуборд', 'драйв', 'экстрим'], 
  ['сёрфинг', 'волна', 'единение'], ['альпинизм', 'высота', 'преодоление'], 
  ['кемпинг', 'природа', 'единение'], ['пикник', 'отдых', 'еда'], 
  ['барбекю', 'вкус', 'ожог'], ['вино', 'наслаждение', 'томность'], 
  ['чай', 'уют', 'спокойствие'], ['печенье', 'сладость', 'комфорт'], 
  ['мороженое', 'детство', 'радость'], ['торт', 'праздник', 'удовольствие'], 
  ['свечи', 'романтика', 'уют'], ['камин', 'тепло', 'спокойствие'], 
  ['книги', 'обсуждение', 'вдохновение'], ['кино', 'эмоции', 'впечатления'], 
  ['театр', 'искусство', 'переживание'], ['концерт', 'музыка', 'единение'], 
  ['выставка', 'творчество', 'картина'], ['музей', 'история', 'познание'], 
  ['парк', 'скамейка', 'отдых'], ['скейтпарк', 'движение', 'адреналин'], 
  ['зоопарк', 'животные', 'радость'], ['цирк', 'фокус', 'восторг'], 
  ['диснейленд', 'сказка', 'замок'], ['пляж', 'релакс', 'солнце'], 
  ['остров', 'рай', 'безмятежность'], ['гамак', 'неспешность', 'отдых'], 
  ['гадание', 'тайна', 'интрига'], ['астрология', 'звёзды', 'судьба'], 
  ['сон', 'восстановление', 'мечты'], ['благодать', 'свет', 'гармония']];
  
  for var i := 1 to count do
  begin
    var s := wrds[Random(wrds.Length)];
    var sets := Dict('A' to s[0], 'B' to s[1], 'C' to s[2]);
    var ts := GenTemplates();
    var setVals := GenSetsValues();
    var dt := CalcSets(ts, setVals, sets);
    var ri := Random(0, 3);
    var p := dt.ElementAt(ri);
    dt.Remove(p.Key);
    var lb := NewLine;
    var task1 := 'В языке запросов поискового сервера для обозначения ' + 
    'логической операции «ИЛИ» используется символ «|», ' + 
    'а для обозначения логической операции «И» – символ «&».' + lb + 
    'В таблице приведены запросы и количество страниц.';
    var task2 := 'Какое количество страниц будет найдено по запросу ' + 
    p.Key + '?';
    var dt2 := dt.Select(p -> (p.Key, p.Value.ToString)).ToList;
    res.Add((task1, dt2, task2, p.Value.ToString));
  end;
  
  result := res;
end;

end.